# frozen_string_literal: true

namespace :catalog do
  # Catalog
  desc 'Start'
  task start: :environment do
    if Category.exists?
      p 'Catalog already exists!'
    else
      catalog_hash = [
        # Мебель
        { # Мебель для кухни
          name: { ru: 'Мебель для кухни', en: 'Kitchen furniture', uk: 'Кухонні меблі', he: 'ריהוט מטבח',
                  category: 'furniture' },
          things: [
            { ru: 'Кухни',                     en: 'Kitchens',                uk: 'Кухні',
              he: 'מטבח' },
            { ru: 'Диван для кухни (прямой)',  en: 'Kitchen sofa (straight)', uk: 'Кухонний диван (прямий)',
              he: 'ספת מטבח (ישר)' },
            { ru: 'Диван для кухни (угловой)', en: 'Kitchen sofa (corner)',   uk: 'Кухонний диван (кутовий)',
              he: 'ספה למטבח (פינה)' },
            { ru: 'Стулья',                    en: 'Chairs',                  uk: 'Стільці',
              he: 'כיסאות' },
            { ru: 'Столы для кухни',           en: 'Kitchen table',           uk: 'Кухонний стіл',
              he: 'שולחן מטבח' },
            { ru: 'Обеденные группы',          en: 'Dinner parties',          uk: 'Обідні групи',
              he: 'ארוחות ערב חגיגיות' }
          ]
        },
        { # Мягкая мебель
          name: { ru: 'Мягкая мебель', en: 'Upholstered furniture', uk: "М'які меблі", he: 'רהיטים מרופדים',
                  category: 'furniture' },
          things: [
            { ru: 'Диван прямой (двухместный)', en: 'Sofa straight (double)',     uk: 'Прямий диван (двомісний)',
              he: 'ספה ישרה (כפולה)' },
            { ru: 'Диван прямой (трехместный)', en: 'Sofa straight (triple)',     uk: 'Прямий диван (тримісний)',
              he: 'ספה ישרה (משולשת)' },
            { ru: 'Диван угловой',              en: 'Sofa corner',                uk: 'Кутовий диван',
              he: 'ספה פינתית' },
            { ru: 'Диван модульный',            en: 'Sofa modular',               uk: 'Модульний диван',
              he: 'ספה מודולרית' },
            { ru: 'Тахты',                      en: 'Couches',                    uk: 'Кушети',
              he: 'ספות' },
            { ru: 'Кресла',                     en: 'Armchairs',                  uk: 'Крісла',
              he: 'כיסא גדול' },
            { ru: 'Пуфы, банкетки',             en: 'Poufs, banquets',            uk: 'Пуфи, банкети',
              he: 'פופס, נשפים' },
            { ru: 'Набор мягкой мебели',        en: 'Upholstered furniture set',  uk: "Комплект м'яких меблів",
              he: 'רהיטים מרופדים' },
            { ru: 'Бескаркасная мебель',        en: 'Frameless furniture',        uk: 'Безкорпусні меблі',
              he: 'רהיטים חסרי מסגרת' }
          ]
        },
        { # Корпусная мебель
          name: { ru: 'Корпусная мебель', en: 'Cabinet furniture', uk: 'Корпусні меблі', he: 'ריהוט ארון',
                  category: 'furniture' },
          things: [
            { ru: 'Шкафы-купе',              en: 'Closets',               uk: 'Шафи',                he: 'ארונות' },
            { ru: 'Стенки',                  en: 'Wall',                  uk: 'Стінка',              he: 'קירות' },
            { ru: 'Гардеробные',             en: 'Dressing rooms',        uk: 'Гардеробні',
              he: 'חדרי הלבשה' },
            { ru: 'Распашные шкафы',         en: 'Swing cabinets',        uk: 'Распашные шкафы',
              he: 'ארונות סווינג' },
            { ru: 'Столы',                   en: 'Tables',                uk: 'Столи',               he: 'שולחנות' },
            { ru: 'Стеллажи',                en: 'Racks',                 uk: 'Стелажі',             he: 'ספות' },
            { ru: 'Тумбы',                   en: 'Drawers',               uk: 'Тумби',               he: 'כן' },
            { ru: 'Комоды',                  en: 'Racking',               uk: 'Комоди',              he: 'מגירות' },
            { ru: 'Трансформируемая мебель', en: 'Convertible furniture', uk: "Меблі 'Трансформер'",
              he: 'רהיטים עם גג נפתח' }
          ]
        },
        { # Офисная мебель
          name: { ru: 'Офисная мебель', en: 'Office furniture', uk: 'Офісні меблі', he: 'ריהוט משרדי',
                  category: 'furniture' },
          things: [
            { ru: 'Офисные столы',              en: 'Office Desks',                 uk: 'Офісні столи',
              he: 'שולחנות משרדיים' },
            { ru: 'Офисные стойки, ресепшн',    en: 'Office racks, reception desk', uk: 'Офісні стелажі, ресепшн',
              he: 'מדפי משרד' },
            { ru: 'Офисные шкафы',              en: 'Office cabinets',              uk: 'Офісні шафи',
              he: 'ארונות משרדים' },
            { ru: 'Офисные тумбы',              en: 'Office drawers',               uk: 'Офісні тумби',
              he: 'ארונות משרדים' },
            { ru: 'Офисные диваны',             en: 'Office sofas',                 uk: 'Офісні дивани',
              he: 'ספות משרד' },
            { ru: 'Офисные кресла',             en: 'Office chairs',                uk: 'Офісні крісла',
              he: 'רהיטים חסרי מסגרת' },
            { ru: 'Офисные стулья',             en: 'Office seats',                 uk: 'Офісні стільці',
              he: 'כיסאות משרדיים' },
            { ru: 'Мини-кухни для офиса',       en: 'Office kitchens',              uk: 'Офісні кухні',
              he: 'מטבחים משרדיים' }
          ]
        },
        { # Детская мебель
          name: { ru: 'Детская мебель', en: 'Children’s furniture', uk: 'Дитячі меблі', he: 'ריהוט ילדים',
                  category: 'furniture' },
          things: [
            { ru: 'Шкафы для детской',          en: 'Cabinets',          uk: 'Дитячі шафи',
              he: 'חדר ילדים' },
            { ru: 'Стеллажи для детской',       en: 'Racks',             uk: 'Дитячі стелажі',
              he: 'מדפי ילדים' },
            { ru: 'Детские кровати',            en: 'Beds',              uk: 'Дитячі ліжка',
              he: 'מיטות ילדים' },
            { ru: 'Диваны для детской',         en: 'Sofas',             uk: 'Дитячі дивани',
              he: 'ספות חדר ילדים' },
            { ru: 'Кроватки для новорожденных', en: 'Сots for newborns', uk: 'Дитячі ліжечка для немовлят',
              he: 'עריסה' },
            { ru: 'Деткие столы',               en: 'Tables',            uk: 'Дитячі столи',
              he: 'שולחנות תינוקות' },
            { ru: 'Детские стулья',             en: 'Seats',             uk: 'Дитячі стільці',
              he: 'כיסאות גבוהים' },
            { ru: 'Стульчики для кормления',    en: 'Feeding chairs',    uk: 'Дитячі стільці для годування',
              he: 'כיסאות האכלה' },
            { ru: 'Пеленальные комоды',         en: 'Changing cabinets', uk: 'Пеленальні комоди',
              he: 'להחליף ארונות' }
          ]
        },
        { # Мебель для спальни
          name: { ru: 'Мебель для спальни', en: 'Bedroom furniture', uk: 'Меблі для спальні',
                  he: 'ריהוט חדר שינה', category: 'furniture' },
          things: [
            { ru: 'Кровати',                  en: 'Bed',                uk: 'Ліжка', he: 'מיטות' },
            { ru: 'Спальные гарнитуры',       en: 'Bedroom set',        uk: 'Спальні гарнітури',
              he: 'סט חדר שינה' },
            { ru: 'Матрасы',                  en: 'Mattress',           uk: 'Матрац', he: 'מזרנים' },
            { ru: 'Ортопедические основания', en: 'Orthopedic grounds', uk: 'Ортопедичні підстави',
              he: 'שטחים אורתופדיים' },
            { ru: 'Подушки',                  en: 'Pillow',             uk: 'Подушка', he: 'כריות' },
            { ru: 'Прикроватные тумбы',       en: 'Bedside cabinets',   uk: 'Тумби',
              he: 'ארונות ליד המיטה' }
          ]
        },
        { # Мебель из массива
          name: { ru: 'Мебель из массива', en: 'Solid furniture', uk: 'Деревʼяні меблі', he: 'ריהוט מוצק',
                  category: 'furniture' },
          things: [
            { ru: 'Столы из массива',         en: 'Array tables',           uk: 'Деревʼяні столи',
              he: 'טבלאות מערך' },
            { ru: 'Кровати из массива',       en: 'Bed array',              uk: 'Деревʼяні ліжка',
              he: 'מערך מיטות' },
            { ru: 'Наборы мебели из массива', en: 'Solid Furniture Sets',   uk: 'Деревʼяні меблі Sets',
              he: 'ריהוט מלא' },
            { ru: 'Шкафы из массива',         en: 'Solid Case Cabinets',    uk: 'Суцільні шафи',
              he: 'ארונות מזוודות מוצקות' },
            { ru: 'Стеллажи из массива',      en: 'Solid Shelving',         uk: 'Суцільні шельфування',
              he: 'מדפים מוצקים' },
            { ru: 'Буфеты из массива',        en: 'Buffets from the array', uk: 'Деревєяні шафи',
              he: 'מזנונים מהמערך' },
            { ru: 'Тумбы  из массива',        en: 'Array cabinets',         uk: 'Деревʼяні комоди',
              he: 'ארונות מערך' },
            { ru: 'Комоды из массива',        en: 'Array chest of drawers', uk: 'Комоды из массива',
              he: 'מערך שידת מגירות' },
            { ru: 'Лестницы из массива ',     en: 'Array ladder',           uk: 'Деревʼяні сходи',
              he: 'סולם מערך' }
          ]
        },
        { # Садовая мебель
          name: { ru: 'Садовая мебель', en: 'Garden furniture', uk: 'Садові меблі', he: 'ריהוט גן',
                  category: 'furniture' },
          things: [
            { ru: 'Кованая мебель',     en: 'Forged furniture',   uk: 'Ковані меблі',         he: 'רהיטים מזויפים' },
            { ru: 'Мебель для отдыха',  en: 'Vacation furniture', uk: 'Меблі для відпочинку', he: 'ריהוט נופש' },
            { ru: 'Плетеная мебель',    en: 'Wicker furniture',   uk: 'Плетені меблі',        he: 'רהיטי נצרים' },
            { ru: 'Пластиковая мебель', en: 'Plastic furniture',  uk: 'Пластикові меблі',     he: 'רהיטים מפלסטיק' }
          ]
        },
        { # Комплектующие для мебели
          name: { ru: 'Комплектующие для мебели', en: 'Furniture accessories', uk: 'Фурнітура для меблів',
                  he: 'אביזרי ריהוט', category: 'furniture' },
          things: [
            { ru: 'Столешницы, барные стойки', en: 'Countertops, bar counters', uk: 'Барні стійки',
              he: 'משטחים, דלפקי בר' },
            { ru: 'Мебельные фасады',          en: 'Furniture facades',         uk: 'Меблеві фасади',
              he: 'חזיתות רהיטים' },
            { ru: 'Фурнитура',                 en: 'Accessories',               uk: 'Аксесуари', he: 'אביזרים' },
            { ru: 'Мойки, раковины',           en: 'Sinks',                     uk: 'Раковини',
              he: 'כיורים' }
          ]
        },
        { # Двери
          name: { ru: 'Двери', en: 'Door', uk: 'Двері', he: 'דלתות', category: 'interior' },
          things: [
            { ru: 'Перегородки',        en: 'Partitions',     uk: 'Перегородки',     he: 'מחיצות' },
            { ru: 'Входные двери',      en: 'Front door',     uk: 'Вхідні двері',    he: 'דלתות כניסה' },
            { ru: 'Межкомнатные двери', en: 'Interior doors', uk: 'Внутрішні двері', he: 'דלתות פנים' }
          ]
        },
        { # Предметы интерьера
          name: { ru: 'Предметы интерьера', en: 'Interior', uk: "Інтер'єр", he: 'פנים',
                  category: 'interior' },
          things: [
            { ru: 'Зеркала',            en: 'Looking glass',   uk: 'Дзеркало',        he: 'מראות' },
            { ru: 'Вешалки',            en: 'Coat hangers',    uk: 'Вішаки',          he: 'קולבים' },
            { ru: 'Стеллаж',            en: 'Rack',            uk: 'Стелаж',          he: 'מדף' },
            { ru: 'Настенные полки',    en: 'Wall shelves',    uk: 'Полиця',          he: 'מדפי קיר' },
            { ru: 'Вазоны, цветочницы', en: 'Vases, florists', uk: 'Вази',            he: 'אגרטלים, פרחים' },
            { ru: 'Камины',             en: 'Fire place',      uk: 'Каміни',          he: 'קמינים' },
            { ru: 'Элементы декора',    en: 'Decor elements',  uk: 'Елементи декору', he: 'אלמנטים של עיצוב' }
          ]
        },
        # Бытовая техника
        { # Бытовая техника для кухни
          name: { ru: 'Бытовая техника для кухни', en: 'Kitchen appliances', uk: 'Кухонна техніка',
                  he: 'מכשירי מטבח', category: 'technique' },
          things: [
            { ru: 'Холодильники до 100 л.',            en: 'Refrigerators up to 100 liters',
              uk: 'Холодильники до 100 л.',            he: 'מקררים עד 100 ליטר' },
            { ru: 'Холодильники 200-300 л.',           en: 'Refrigerators 200-300 liters',
              uk: 'Холодильники 200-300 л.',           he: 'מקררים 200-300 ליטר' },
            { ru: 'Холодильники 300-500 л.',           en: 'Refrigerators 300-500 liters',
              uk: 'Холодильники 300-500 л.',           he: 'מקררים 300-500 ליטר' },
            { ru: 'Холодильники свыше 500 л.',         en: 'Refrigerators over 500 liters',
              uk: 'Холодильники понад 500 л.',         he: 'מקררים מעל 500 ליטר' },
            { ru: 'Встраиваемые духовые шкафы',        en: 'Built-in oven',
              uk: 'Вбудована духовка',                 he: 'תנור מובנה' },
            { ru: 'Плиты',                             en: 'Plate',
              uk: 'Плита',                             he: 'תנור מובנה' },
            { ru: 'Микроволновые печи, электропечи',   en: 'Microwave ovens, electric ovens',
              uk: 'Мікрохвильові, електричні печі',    he: 'תנורי מיקרוגל' },
            { ru: 'Кухонные комбайны, измельчители',   en: 'Kitchen harvesters, shredders',
              uk: 'Кухонні комбайни, подрібнювачі',    he: 'קוצרי מטבח, גורסים' },
            { ru: 'Пароварки',                         en: 'Steamer',
              uk: 'Пароварка',                         he: 'ספינת קיטור' },
            { ru: 'Миксеры',                           en: 'Mixers',
              uk: 'Змішувачі',                         he: 'מערבלים' },
            { ru: 'Аэрогрили',                         en: 'Airgrills',
              uk: 'Аиргриллес',                        he: 'Airgrills' },
            { ru: 'Электрогрили',                      en: 'Electric grills',
              uk: 'Електричні грилі',                  he: 'גריל חשמלי' },
            { ru: 'Вафельницы, блинницы, сэндвичницы', en: 'Waffle irons, pancakes, sandwiches',
              uk: 'Вафельниці, млинниці, тостери',     he: 'מגהצים, פנקייקים, כריכים' },
            { ru: 'Сушилки для овощей и фруктов',      en: 'Vegetable and Fruit Dryers',
              uk: 'Овочеві і фруктові дрієри',         he: 'מייבשי ירקות ופירות' },
            { ru: 'Встраиваемые рабочие поверхности',  en: 'Embedded work surfaces',
              uk: 'Вбудовані робочі поверхні',         he: 'משטחי עבודה מוטבעים' },
            { ru: 'Вытяжки',                           en: 'Extracts',
              uk: 'Витяжки',                           he: 'ברדסים' },
            { ru: 'Посудомоечные машины',              en: 'Dishwashers',
              uk: 'Посудомийні машини',                he: 'מדיחי כלים' },
            { ru: 'Электрочайники и термопоты',        en: 'Electric kettles and thermopots',
              uk: 'Електричні чайники і термоси',      he: 'קומקומים חשמליים' },
            { ru: 'Мясорубки',                         en: 'Meat grinder',
              uk: "М'ясорубка",                        he: 'מטחנת בשר' },
            { ru: 'Хлебопечки, тостеры',               en: 'Bread presses, toasters',
              uk: 'Хлібопічки',                        he: 'מכבשי לחם, טוסטרים' },
            { ru: 'Ломтерезки',                        en: 'Slicery',
              uk: 'Слікері',                           he: 'סליקרי' },
            { ru: 'Йогуртницы и мороженицы',           en: 'Yogurts and Ice Creams',
              uk: 'Йогуртниці та морожениці',          he: 'יוגורטים וגלידות' },
            { ru: 'Измельчители пищевых отходов',      en: 'Food Waste Disposal',
              uk: 'Утилізація харчових відходів',      he: 'פינוי פסולת מזון' },
            { ru: 'Маринаторы',                        en: 'Marinators',
              uk: 'Маринатори',                        he: 'מארינאטורים' },
            { ru: 'Кофеварки и кофемашины',            en: 'Coffeemakers',
              uk: 'Кофемолки',                         he: 'מכונת קפה' },
            { ru: 'Кофемолки',                         en: 'Coffee grinder',
              uk: 'Кавоварки',                         he: 'מטחנת קפה' },
            { ru: 'Мультиварки',                       en: 'Crock-pot',
              uk: 'Мультиварки',                       he: 'קקי-סיר' },
            { ru: 'Соковыжималки',                     en: 'Juicers',
              uk: 'Соковижималки',                     he: 'Juicers' },
            { ru: 'Винные шкафы',                      en: 'Wine cabinets',
              uk: 'Винні шафи',                        he: 'ארונות יין' },
            { ru: 'Фритюрницы',                        en: 'Deep fryer',
              uk: 'Фритюрниці',                        he: 'טיגון עמוק' }
          ]
        },
        { # Бытовая техника для дома
          name: { ru: 'Бытовая техника для дома', en: 'Home appliances', uk: 'Побутова техніка',
                  he: 'מכשירי חשמל ביתיים', category: 'technique' },
          things: [
            { ru: 'Стиральные машины',      en: 'Washing machine',                   uk: 'Пральні машини',
              he: 'מכונות כביסה' },
            { ru: 'Сушильные машины',       en: 'Drying machines',                   uk: 'Сушильні машини',
              he: 'מכונות ייבוש' },
            { ru: 'Все для кройки и шитья', en: 'Everything for cutting and sewing', uk: 'Все для шиття',
              he: 'הכל בשביל לחתוך ולתפור' },
            { ru: 'Пылесосы',               en: 'Vacuum cleaners',                   uk: 'Пилососи',
              he: 'שואבי אבק' }
          ]
        },
        { # Климатическое оборудование
          name: { ru: 'Климатическое оборудование', en: 'Climatic equipment', uk: 'Кліматичне обладнання',
                  he: 'ציוד אקלימי', category: 'technique' },
          things: [
            { ru: 'Кондиционеры, тепловые завесы',    en: 'Air conditioners, thermal curtains',
              uk: 'Кондиціонери',                             he: 'מזגנים' },
            { ru: 'Обогреватели и электрокамины',     en: 'Heaters and electric fireplaces',
              uk: 'Обігрівачі та електричні каміни',          he: 'מחממים ומכבי אש חשמליים' },
            { ru: 'Тепловые пушки',                   en: 'Heat guns',
              uk: 'Теплові пушки',                            he: 'משאבות חום' },
            { ru: 'Водоногреватели',                  en: 'Water heater',
              uk: 'Водонагрівач',                             he: 'דוד מים' },
            { ru: 'Очистители и увлажнители воздуха', en: 'Air purifiers and humidifiers',
              uk: 'Очищувачі повітря та зволожувачі повітря', he: 'מטהרי אוויר ומכשירי לחות' },
            { ru: 'Вентиляторы',                      en: 'Fans',
              uk: 'Вентиляторы',                              he: 'המאווררים' }
          ]
        },
        { # Картонные коробки
          name: { ru: 'Коробки', en: 'Cartons', uk: 'Коробки', he: 'קרטון', category: 'сartons' },
          things: [
            { ru: '1340х630х470',    en: '1340х630х470', uk: '1340х630х470',    he: '1340х630х470' },
            { ru: '1020х600х430',    en: '1020х600х430', uk: '1020х600х430',    he: '1020х600х430' },
            { ru: '790х390х375',     en: '790х390х375',  uk: '790х390х375',     he: '790х390х375' },
            { ru: '650х350х350',     en: '650х350х350',  uk: '650х350х350',     he: '650х350х350' },
            { ru: '380х285х95',      en: '380х285х95',   uk: '380х285х95',      he: '380х285х95' },
            { ru: '355х240х125',     en: '355х240х125',  uk: '355х240х125',     he: '355х240х125' },
            { ru: '340х200х200',     en: '340х200х200',  uk: '340х200х200',     he: '340х200х200' },
            { ru: '305х220х125',     en: '305х220х125',  uk: '305х220х125',     he: '305х220х125' },
            { ru: '305х205х210',     en: '305х205х210',  uk: '305х205х210',     he: '305х205х210' },
            { ru: '250х250х150',     en: '250х250х150',  uk: '250х250х150',     he: '250х250х150' }
          ]
        }
      ]

      catalog_hash.each do |category|
        Category.create(category[:name])
        category[:things].each { |thing| Category.find_by(ru: category[:name][:ru].to_s).things.create(thing) }
      end

      p "Created #{Category.count} categories and #{Thing.count} things"
    end
  end
end
